tutorials/TEST/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

zSize	0.4;
xLeft	-0.2;
xRight	0.2;
ySize	0.01;

Nx	40;
Nz	40;

vertices
(
    ($xLeft 0 0)	//0
    ($xRight 0 0)	//1
    ($xRight $ySize 0)	//2
    ($xLeft $ySize 0)	//3
    
    
    ($xLeft 0 $zSize)	//4
    ($xRight 0 $zSize)	//5
    ($xRight $ySize $zSize)	//6
    ($xLeft $ySize $zSize)	//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($Nx 1 $Nz) simpleGrading (1 1 1)
    /*
    hex (5 4 9 10 24 23 28 29) (10 10 11) simpleGrading (1 1 1)
    hex (0 1 4 5 19 20 23 24) (10 10 11) simpleGrading (1 1 1)
    hex (1 2 3 4 20 21 22 23) (20 10 11) simpleGrading (1 1 1)
    hex (4 3 6 7 23 22 25 26) (20 20 11) simpleGrading (1 1 1)
    hex (9 4 7 8 28 23 26 27) (10 20 11) simpleGrading (1 1 1)
    hex (15 16 10 9 34 35 29 28) (10 10 11) simpleGrading (1 1 1)
    hex (12 11 16 15 31 30 35 34) (10 10 11) simpleGrading (1 1 1)
    hex (13 12 15 14 32 31 34 33) (20 10 11) simpleGrading (1 1 1)
    hex (14 15 18 17 33 34 37 36) (20 20 11) simpleGrading (1 1 1)
    hex (15 9 8 18 34 28 27 37) (10 20 11) simpleGrading (1 1 1)
    */
);

edges
(
);
/*
defaultPatch
{
    name frontAndBack;
    type empty;
}
*/


boundary
(
    filmWalls
    {
        type wall;
        faces
        (
    	     (0 1 2 3)
        );
    }
    sides
    {
        type patch;
        faces
        (
    	    (4 5 6 7)
    	    (0 4 7 3)
    	    (1 2 6 5)
        );
    }
    frontAndBack
    {
	type empty;
	faces
	(
	    (0 1 5 4)
	    (3 2 6 7)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
