tutorials/TEST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    sides
    {
        type            patch;
        nFaces          120;
        startFace       3120;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       3240;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          40;
        startFace       6440;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
40
(
(5.551115123e-17 -0 -0)
(2.775557562e-17 -0 -0)
(8.326672685e-17 -1.734723476e-18 -0)
(2.775557562e-17 -0 -0)
(2.775557562e-17 -0 -0)
(-0 -8.67361738e-19 -0)
(-0 -0 -0)
(1.387778781e-17 -0 -0)
...
)
;
    }
)

// ************************************************************************* //
