tutorials/TEST/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      surfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel Myers;

region          wallFilmRegion;

active          true;

MyersCoeffs
{
    filmThermoModel liquid;

    Lf 335e3;

    rhoIce 900;

    kappaIce	2.18;

    CpIce	2030;

    liquidCoeffs
    {
        useReferenceValues  no;
        liquid      H2O;
    }

    filmViscosityModel liquid;

    deltaWet    1e-4;

    hydrophilic no;

    turbulence  laminar;
    laminarCoeffs
    {
        Cf          0.005;
    }

    forces
    (
        thermocapillary
    );

    injectionModels ();

    phaseChangeModel none;

    radiationModel none;

    upperSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0                1e-8;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0                1e-8;
        }
    }
}
