tutorials/TEST/0.orig/wallFilmRegion/betta0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/wallFilmRegion";
    object      betta0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
1600
(
1.266216808e-08
7.272016046e-08
3.809311524e-07
1.820048916e-06
7.931668186e-06
3.152760078e-05
0.0001143042071
0.0003779883509
...
)
;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            zeroGradient;//fixedValue;
        //value		$internalField;
    }
}


// ************************************************************************* //
